INSERT INTO Users (login_id, nickname, password, self_introduction, address, birth_year, gender, security_key, status)
VALUES
    ('user1', '1_ダミーユーザー', 'password1', 'これは1_ダミーの自己紹介です', '1_ダミー住所', 1990, 0, 'key1', 1),
    ('user2', '2_ダミーユーザー', 'password2', 'これは2_ダミーの自己紹介です', '2_ダミー住所', 1991, 1, 'key2', 1),
    ('user3', '3_ダミーユーザー', 'password3', 'これは3_ダミーの自己紹介です', '3_ダミー住所', 1992, 0, 'key3', 1),
    ('user4', '4_ダミーユーザー', 'password4', 'これは4_ダミーの自己紹介です', '4_ダミー住所', 1993, 1, 'key4', 1),
    ('user5', '5_ダミーユーザー', 'password5', 'これは5_ダミーの自己紹介です', '5_ダミー住所', 1994, 2, 'key5', 1),
    ('user6', '6_ダミーユーザー', 'password6', 'これは6_ダミーの自己紹介です', '6_ダミー住所', 1995, 0, 'key6', 1),
    ('user7', '7_ダミーユーザー', 'password7', 'これは7_ダミーの自己紹介です', '7_ダミー住所', 1996, 1, 'key7', 1),
    ('user8', '8_ダミーユーザー', 'password8', 'これは8_ダミーの自己紹介です', '8_ダミー住所', 1997, 0, 'key8', 1),
    ('user9', '9_ダミーユーザー', 'password9', 'これは9_ダミーの自己紹介です', '9_ダミー住所', 1998, 1, 'key9', 1),
    ('user10', '10_ダミーユーザー', 'password10', 'これは10_ダミーの自己紹介です', '10_ダミー住所', 1990, 2, 'key10', 1),
    ('user11', '11_ダミーユーザー', 'password11', 'これは11_ダミーの自己紹介です', '11_ダミー住所', 1991, 0, 'key11', 1),
    ('user12', '12_ダミーユーザー', 'password12', 'これは12_ダミーの自己紹介です', '12_ダミー住所', 1992, 1, 'key12', 1),
    ('user13', '13_ダミーユーザー', 'password13', 'これは13_ダミーの自己紹介です', '13_ダミー住所', 1993, 0, 'key13', 1),
    ('user14', '14_ダミーユーザー', 'password14', 'これは14_ダミーの自己紹介です', '14_ダミー住所', 1994, 1, 'key14', 1),
    ('user15', '15_ダミーユーザー', 'password15', 'これは15_ダミーの自己紹介です', '15_ダミー住所', 1995, 2, 'key15', 1),
    ('user16', '16_ダミーユーザー', 'password16', 'これは16_ダミーの自己紹介です', '16_ダミー住所', 1996, 0, 'key16', 1),
    ('user17', '17_ダミーユーザー', 'password17', 'これは17_ダミーの自己紹介です', '17_ダミー住所', 1997, 1, 'key17', 1),
    ('user18', '18_ダミーユーザー', 'password18', 'これは18_ダミーの自己紹介です', '18_ダミー住所', 1998, 0, 'key18', 1),
    ('user19', '19_ダミーユーザー', 'password19', 'これは19_ダミーの自己紹介です', '19_ダミー住所', 1990, 1, 'key19', 1),
    ('user20', '20_ダミーユーザー', 'password20', 'これは20_ダミーの自己紹介です', '20_ダミー住所', 1991, 2, 'key20', 1),
    ('user21', '21_ダミーユーザー', 'password21', 'これは21_ダミーの自己紹介です', '21_ダミー住所', 1992, 0, 'key21', 1),
    ('user22', '22_ダミーユーザー', 'password22', 'これは22_ダミーの自己紹介です', '22_ダミー住所', 1993, 1, 'key22', 1),
    ('user23', '23_ダミーユーザー', 'password23', 'これは23_ダミーの自己紹介です', '23_ダミー住所', 1994, 0, 'key23', 1),
    ('user24', '24_ダミーユーザー', 'password24', 'これは24_ダミーの自己紹介です', '24_ダミー住所', 1995, 1, 'key24', 1),
    ('user25', '25_ダミーユーザー', 'password25', 'これは25_ダミーの自己紹介です', '25_ダミー住所', 1996, 2, 'key25', 1),
    ('user26', '26_ダミーユーザー', 'password26', 'これは26_ダミーの自己紹介です', '26_ダミー住所', 1997, 0, 'key26', 1),
    ('user27', '27_ダミーユーザー', 'password27', 'これは27_ダミーの自己紹介です', '27_ダミー住所', 1998, 1, 'key27', 1),
    ('user28', '28_ダミーユーザー', 'password28', 'これは28_ダミーの自己紹介です', '28_ダミー住所', 1990, 0, 'key28', 1),
    ('user29', '29_ダミーユーザー', 'password29', 'これは29_ダミーの自己紹介です', '29_ダミー住所', 1991, 1, 'key29', 1),
    ('user30', '30_ダミーユーザー', 'password30', 'これは30_ダミーの自己紹介です', '30_ダミー住所', 1992, 2, 'key30', 1);

INSERT INTO admin_users (login_id, nickname, password) VALUES ('morijyobi', '管理人アカウント', 'morijyobi');

INSERT INTO projects (name, url_key, introduction, logo_img_url, theme_color, status, is_visible_book_title, is_visible_review_title, is_visible_user_info, is_public, submission_start_at, submission_end_at, voting_start_at, voting_end_at)
VALUES
    ('冬に読みたい！わたしのおすすめ文庫', 'winter-bunko', '　冬の足音が近づく中、「冬に読みたい文庫本」をテーマに、皆さまからの書評を募集します。 　寒い日につい手に取りたくなる心温まる物語、静かな時間に寄り添う一冊――あなたのおすすめをぜひ教えてください。', 'https://example.com/logo.png', 1, 1, FALSE, TRUE, TRUE, TRUE, '2025-11-01 00:00:00', '2025-11-30 23:59:59', '2025-12-01 00:00:00', '2025-12-15 23:59:59'),
    ('ダミープロジェクト2', 'project3', '雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', 'https://example.com/logo.png', 1, 1, FALSE, TRUE, TRUE, TRUE, '2025-11-01 00:00:00', '2025-11-30 23:59:59', '2025-12-01 00:00:00', '2025-12-15 23:59:59');

INSERT INTO genres (name) VALUES ('ミステリー');

INSERT INTO Reviews
(project_id, user_id, user_nickname, user_address, user_age_group, user_gender, user_self_introduction,
 book_isbn, book_title, book_publisher, book_author, review_title, review_content)
VALUES
    (1, 1, '1_ダミーユーザー', '1_ダミー住所', 33, 0, 'これは1_ダミーの自己紹介です', 1111111111, '1_ダミー本', '1_ダミー出版社', '1_ダミー著者', '1_ダミーレビュー', 'これは1_ダミーのレビュー内容です'),
    (1, 2, '2_ダミーユーザー', '2_ダミー住所', 32, 1, 'これは2_ダミーの自己紹介です', 2222222222, '2_ダミー本', '2_ダミー出版社', '2_ダミー著者', '2_ダミーレビュー', 'これは2_ダミーのレビュー内容です'),
    (1, 3, '3_ダミーユーザー', '3_ダミー住所', 31, 0, 'これは3_ダミーの自己紹介です', 3333333333, '3_ダミー本', '3_ダミー出版社', '3_ダミー著者', '3_ダミーレビュー', 'これは3_ダミーのレビュー内容です'),
    (1, 4, '4_ダミーユーザー', '4_ダミー住所', 30, 1, 'これは4_ダミーの自己紹介です', 4444444444, '4_ダミー本', '4_ダミー出版社', '4_ダミー著者', '4_ダミーレビュー', 'これは4_ダミーのレビュー内容です'),
    (1, 5, '5_ダミーユーザー', '5_ダミー住所', 29, 2, 'これは5_ダミーの自己紹介です', 5555555555, '5_ダミー本', '5_ダミー出版社', '5_ダミー著者', '5_ダミーレビュー', 'これは5_ダミーのレビュー内容です'),
    (1, 6, '6_ダミーユーザー', '6_ダミー住所', 28, 0, 'これは6_ダミーの自己紹介です', 6666666666, '6_ダミー本', '6_ダミー出版社', '6_ダミー著者', '6_ダミーレビュー', 'これは6_ダミーのレビュー内容です'),
    (1, 7, '7_ダミーユーザー', '7_ダミー住所', 27, 1, 'これは7_ダミーの自己紹介です', 7777777777, '7_ダミー本', '7_ダミー出版社', '7_ダミー著者', '7_ダミーレビュー', 'これは7_ダミーのレビュー内容です'),
    (1, 8, '8_ダミーユーザー', '8_ダミー住所', 26, 0, 'これは8_ダミーの自己紹介です', 8888888888, '8_ダミー本', '8_ダミー出版社', '8_ダミー著者', '8_ダミーレビュー', 'これは8_ダミーのレビュー内容です'),
    (1, 9, '9_ダミーユーザー', '9_ダミー住所', 25, 1, 'これは9_ダミーの自己紹介です', 9999999999, '9_ダミー本', '9_ダミー出版社', '9_ダミー著者', '9_ダミーレビュー', 'これは9_ダミーのレビュー内容です'),
    (1, 10, '10_ダミーユーザー', '10_ダミー住所', 34, 2, 'これは10_ダミーの自己紹介です', 1010101010, '10_ダミー本', '10_ダミー出版社', '10_ダミー著者', '10_ダミーレビュー', 'これは10_ダミーのレビュー内容です'),
    (1, 11, '11_ダミーユーザー', '11_ダミー住所', 33, 0, 'これは11_ダミーの自己紹介です', 1111111112, '11_ダミー本', '11_ダミー出版社', '11_ダミー著者', '11_ダミーレビュー', 'これは11_ダミーのレビュー内容です'),
    (1, 12, '12_ダミーユーザー', '12_ダミー住所', 32, 1, 'これは12_ダミーの自己紹介です', 1212121212, '12_ダミー本', '12_ダミー出版社', '12_ダミー著者', '12_ダミーレビュー', 'これは12_ダミーのレビュー内容です'),
    (1, 13, '13_ダミーユーザー', '13_ダミー住所', 31, 0, 'これは13_ダミーの自己紹介です', 1313131313, '13_ダミー本', '13_ダミー出版社', '13_ダミー著者', '13_ダミーレビュー', 'これは13_ダミーのレビュー内容です'),
    (1, 14, '14_ダミーユーザー', '14_ダミー住所', 30, 1, 'これは14_ダミーの自己紹介です', 1414141414, '14_ダミー本', '14_ダミー出版社', '14_ダミー著者', '14_ダミーレビュー', 'これは14_ダミーのレビュー内容です'),
    (1, 15, '15_ダミーユーザー', '15_ダミー住所', 29, 2, 'これは15_ダミーの自己紹介です', 1515151515, '15_ダミー本', '15_ダミー出版社', '15_ダミー著者', '15_ダミーレビュー', 'これは15_ダミーのレビュー内容です'),
    (1, 16, '16_ダミーユーザー', '16_ダミー住所', 28, 0, 'これは16_ダミーの自己紹介です', 1616161616, '16_ダミー本', '16_ダミー出版社', '16_ダミー著者', '16_ダミーレビュー', 'これは16_ダミーのレビュー内容です'),
    (1, 17, '17_ダミーユーザー', '17_ダミー住所', 27, 1, 'これは17_ダミーの自己紹介です', 1717171717, '17_ダミー本', '17_ダミー出版社', '17_ダミー著者', '17_ダミーレビュー', 'これは17_ダミーのレビュー内容です'),
    (1, 18, '18_ダミーユーザー', '18_ダミー住所', 26, 0, 'これは18_ダミーの自己紹介です', 1818181818, '18_ダミー本', '18_ダミー出版社', '18_ダミー著者', '18_ダミーレビュー', 'これは18_ダミーのレビュー内容です'),
    (1, 19, '19_ダミーユーザー', '19_ダミー住所', 25, 1, 'これは19_ダミーの自己紹介です', 1919191919, '19_ダミー本', '19_ダミー出版社', '19_ダミー著者', '19_ダミーレビュー', 'これは19_ダミーのレビュー内容です'),
    (1, 20, '20_ダミーユーザー', '20_ダミー住所', 34, 2, 'これは20_ダミーの自己紹介です', 2020202020, '20_ダミー本', '20_ダミー出版社', '20_ダミー著者', '20_ダミーレビュー', 'これは20_ダミーのレビュー内容です'),
    (1, 21, '21_ダミーユーザー', '21_ダミー住所', 33, 0, 'これは21_ダミーの自己紹介です', 2121212121, '21_ダミー本', '21_ダミー出版社', '21_ダミー著者', '21_ダミーレビュー', 'これは21_ダミーのレビュー内容です'),
    (1, 22, '22_ダミーユーザー', '22_ダミー住所', 32, 1, 'これは22_ダミーの自己紹介です', 2222222223, '22_ダミー本', '22_ダミー出版社', '22_ダミー著者', '22_ダミーレビュー', 'これは22_ダミーのレビュー内容です'),
    (1, 23, '23_ダミーユーザー', '23_ダミー住所', 31, 0, 'これは23_ダミーの自己紹介です', 2323232323, '23_ダミー本', '23_ダミー出版社', '23_ダミー著者', '23_ダミーレビュー', 'これは23_ダミーのレビュー内容です'),
    (1, 24, '24_ダミーユーザー', '24_ダミー住所', 30, 1, 'これは24_ダミーの自己紹介です', 2424242424, '24_ダミー本', '24_ダミー出版社', '24_ダミー著者', '24_ダミーレビュー', 'これは24_ダミーのレビュー内容です'),
    (2, 25, '25_ダミーユーザー', '25_ダミー住所', 29, 2, 'これは25_ダミーの自己紹介です', 2525252525, '25_ダミー本', '25_ダミー出版社', '25_ダミー著者', '25_ダミーレビュー', 'これは25_ダミーのレビュー内容です'),
    (2, 26, '26_ダミーユーザー', '26_ダミー住所', 28, 0, 'これは26_ダミーの自己紹介です', 2626262626, '26_ダミー本', '26_ダミー出版社', '26_ダミー著者', '26_ダミーレビュー', 'これは26_ダミーのレビュー内容です'),
    (2, 27, '27_ダミーユーザー', '27_ダミー住所', 27, 1, 'これは27_ダミーの自己紹介です', 2727272727, '27_ダミー本', '27_ダミー出版社', '27_ダミー著者', '27_ダミーレビュー', 'これは27_ダミーのレビュー内容です'),
    (2, 28, '28_ダミーユーザー', '28_ダミー住所', 26, 0, 'これは28_ダミーの自己紹介です', 2828282828, '28_ダミー本', '28_ダミー出版社', '28_ダミー著者', '28_ダミーレビュー', 'これは28_ダミーのレビュー内容です'),
    (2, 29, '29_ダミーユーザー', '29_ダミー住所', 25, 1, 'これは29_ダミーの自己紹介です', 2929292929, '29_ダミー本', '29_ダミー出版社', '29_ダミー著者', '29_ダミーレビュー', 'これは29_ダミーのレビュー内容です'),
    (2, 30, '30_ダミーユーザー', '30_ダミー住所', 24, 2, 'これは30_ダミーの自己紹介です', 3030303030, '30_ダミー本', '30_ダミー出版社', '30_ダミー著者', '30_ダミーレビュー', 'これは30_ダミーのレビュー内容です');

INSERT INTO Posts (admin_id, category, title, content, posted_at, status, is_delete)
VALUES
    (1, 1, '企画情報のお知らせ', '企画情報のお知らせのサンプルです。吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。', '2025-11-02 02:00:00', 3, FALSE),
    (1, 1, '企画情報のお知らせ2', '企画情報のお知らせのサンプル2つ目です。吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。', '2025-11-08 08:00:00', 3, FALSE),
    (1, 1, '企画情報のお知らせ3', '企画情報のお知らせのサンプル3つ目です。吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。', '2025-11-10 10:00:00', 3, FALSE),
    (1, 1, '企画情報のお知らせ4', '企画情報のお知らせのサンプル4つ目です。吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。', '2025-11-13 13:00:00', 3, FALSE),
    (1, 1, '企画情報のお知らせ5', '企画情報のお知らせのサンプル5つ目です。吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。', '2025-11-22 22:00:00', 3, FALSE),
    (1, 2, '寄贈情報のお知らせ', '寄贈情報のお知らせのサンプルです。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。', '2025-11-01 01:00:00', 3, FALSE),
    (1, 2, '寄贈情報のお知らせ2', '寄贈情報のお知らせのサンプル2つ目です。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。', '2025-11-09 09:00:00', 3, FALSE),
    (1, 2, '寄贈情報のお知らせ3', '寄贈情報のお知らせのサンプル3つ目です。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。', '2025-11-12 12:00:00', 3, FALSE),
    (1, 2, '寄贈情報のお知らせ4', '寄贈情報のお知らせのサンプル4つ目です。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。', '2025-11-15 15:00:00', 3, FALSE),
    (1, 2, '寄贈情報のお知らせ5', '寄贈情報のお知らせのサンプル5つ目です。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。', '2025-11-20 20:00:00', 3, FALSE),
    (1, 3, 'その他情報のお知らせ', 'その他情報のお知らせのサンプルです。雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', '2025-11-03 03:00:00', 3, FALSE),
    (1, 3, 'その他情報のお知らせ2', 'その他情報のお知らせのサンプル2つ目です。雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', '2025-11-07 07:00:00', 3, FALSE),
    (1, 3, 'その他情報のお知らせ3', 'その他情報のお知らせのサンプル3つ目です。雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', '2025-11-11 11:00:00', 3, FALSE),
    (1, 3, 'その他情報のお知らせ4', 'その他情報のお知らせのサンプル4つ目です。雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', '2025-11-14 14:00:00', 3, FALSE),
    (1, 3, 'その他情報のお知らせ5', 'その他情報のお知らせのサンプル5つ目です。雨ニモマケズ風ニモマケズ雪ニモ夏ノ暑サニモマケヌ丈夫ナカラダヲモチ慾ハナク決シテ瞋ラズイツモシヅカニワラッテヰル', '2025-11-23 23:00:00', 3, FALSE),
    (1, 1, '削除された企画情報のお知らせ', '削除された企画情報のお知らせのサンプルです。色はにほへど散りぬるを我が世たれぞ常ならむ有為の奥山今日越えて浅き夢見じ酔ひもせず', '2025-11-04 04:00:00', 3, TRUE),
    (1, 2, '非表示の寄贈情報のお知らせ', '非表示の寄贈情報のお知らせのサンプルです。色はにほへど散りぬるを我が世たれぞ常ならむ有為の奥山今日越えて浅き夢見じ酔ひもせず', '2025-11-04 04:00:00', 2, FALSE),
    (1, 3, '下書きのその他情報のお知らせ', '下書きのその他情報のお知らせのサンプルです。色はにほへど散りぬるを我が世たれぞ常ならむ有為の奥山今日越えて浅き夢見じ酔ひもせず', '2025-11-04 04:00:00', 1, FALSE);
